;XCOM 2 relies on per-object config settings like the one below to link X2DataTemplate objects with their associated localized text

[AssaultRifle_PL X2WeaponTemplate]
FriendlyName="Plasma Rifle"
BriefSummary="Highly efficient and deadly primary weapon."
TacticalText="This modified assault rifle fires a jet of ionized gas through a focused magnetic field - an extremely effective plasma-based weapon."

[Shotgun_PL X2WeaponTemplate]
FriendlyName="Alloy Cannon"
BriefSummary="The most advanced version of the shotgun that XCOM can engineer."
TacticalText="By developing a firing mechanism capable of projecting machined shards of the alien alloy, we've created an extremely powerful weapon that has a devastating effect on anything caught in range. However, accuracy falls off quickly over greater distances."

[Cannon_PL X2WeaponTemplate]
FriendlyName="Heavy Plasma"
BriefSummary="The Heavy Plasma rifle uses an expanded power supply and cooling mechanism to allow for a much higher rate of fire than anything we've fielded previously."
TacticalText="The Heavy Plasma rifle uses an expanded power supply and cooling mechanism to allow for a much higher rate of fire than anything we've fielded previously."

[SniperRifle_PL X2WeaponTemplate]
FriendlyName="Plasma Sniper Rifle"
BriefSummary="The deadliest sniper rifle XCOM can engineer"
TacticalText="By modifying our current power system to hold a greater charge, we've developed a Plasma Sniper Rifle capable of delivering an extremely powerful shot that will greatly increase the odds of inflicting critical damage to hostile targets."

[LightPlasmaRifle_PL X2WeaponTemplate]
FriendlyName="Light Plasma Rifle"
BriefSummary="A lower damage variant of the Plasma Rifle."
TacticalText="This lightweight rifle functions on the same principle as our other plasma weapon concepts - a jet of ionized gas discharged through a focused magnetic field."

[Pistol_PL X2WeaponTemplate]
FriendlyName="Plasma Pistol"
BriefSummary="The most powerful pistol available to XCOM."
TacticalText="By discharging a lethal shot of ionized gas in an artificially generated magnetic field, this weapon performs far beyond the capabilities of any projectile based sidearm."